app/controllers/comments_controller.rb

INSERT INTO "comments" ("name", "entry_id", "created_at", "updated_at", "url", "content", "email") VALUES('Test1', 1, '2010-11-18 07:45:59', '2010-11-18 07:45:59', '', 'こんにちは', 'test@mail.jp')
---
  def create
    @comment = @entry.comments.new(params[:comment])

    respond_to do |format|
      if @comment.save

SELECT * FROM "entries" WHERE ("entries"."id" = 1)
---
  def load_entry
    @entry = Entry.find(params[:entry_id])