app/controllers/entries_controller.rb

  def index
    conditions = {:order => 'entries.created_at DESC', :include => :tags}
    conditions.update(
      Entry.find_options_for_find_tagged_with(params[:tag])
    ) if params[:tag]
---
SELECT tags.id, tags.name, COUNT(*) AS count FROM "tags" INNER JOIN taggings ON tags.id = taggings.tag_id INNER JOIN entries ON entries.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Entry') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0

  def show
    @entry = Entry.find(params[:id])
---
SELECT * FROM "entries" WHERE ("entries"."id" = 1)

  def edit
    @entry = Entry.find(params[:id])
---
SELECT * FROM "entries" WHERE ("entries"."id" = 2)

  def create
    @entry = Entry.new(params[:entry])

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("created_at", "title", "updated_at", "content") VALUES('2010-11-17 08:55:05', 'Railsでブログ', '2010-11-17 08:55:05', 'とても簡単に構築できます。')

  def update
    @entry = Entry.find(params[:id])

    respond_to do |format|
      if @entry.update_attributes(params[:entry])
---
SELECT * FROM "entries" WHERE ("entries"."id" = 2)
UPDATE "entries" SET "updated_at" = '2010-11-17 08:57:14', "title" = 'ブログのタイトル', "content" = 'ブログの記事' WHERE "id" = 2

  def destroy
    @entry = Entry.find(params[:id])
    @entry.destroy
---
SELECT * FROM "entries" WHERE ("entries"."id" = 3)
DELETE FROM "entries" WHERE "id" = 3

  def load_sidebar
    @tags = Entry.tag_counts
    @side_entries = Entry.find(:all, :limit => 5, :order => 'created_at DESC')
    @side_comments = Comment.find(:all, :limit => 5, :order => 'comments.created_at DESC', :include => :entry)
    @side_trackbacks = Trackback.find(:all, :limit => 5, :order => 'trackbacks.created_at DESC', :include => :entry)
---
SELECT * FROM "entries" WHERE ("entries"."id" = 1)
SELECT * FROM "comments" WHERE ("comments".entry_id = 1) ORDER BY created_at ASC
SELECT * FROM "trackbacks" WHERE ("trackbacks".entry_id = 1) ORDER BY created_at ASC