app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', '10ce34ef8f8c229f25005bd1435991a6b043e245', '2010-11-18 02:49:05', '3843c0e1074897f812ca5fa1d55aedbf14d3a997', NULL, '2010-11-18 02:49:05', NULL, 'admin', 'admin@admin.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save